In [3]:
import pandas as pd
m=pd.read_csv("car_financing.csv")
m.head()

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna

In [4]:
m.columns

Index(['Month', 'Starting Balance', 'Repayment', 'Interest Paid',
       'Principal Paid', 'New Balance', 'term', 'interest_rate', 'car_type'],
      dtype='object')

In [5]:
m.describe()

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate
count,408.000000,408.000000,408.000000,408.000000,408.000000,408.000000,408.000000,408.000000
mean,26.970588,17562.870343,712.134118,56.715123,655.418995,16907.451348,52.941176,0.039603
std,16.207776,11224.423084,247.447947,40.775353,245.361625,11168.974693,9.268926,0.013414
min,1.000000,395.410000,396.820000,1.280000,326.620000,-0.490000,36.000000,0.029000
25%,13.000000,8557.900000,486.740000,26.257500,476.972500,7832.080000,48.000000,0.029000
50%,26.000000,16262.230000,661.995000,50.640000,598.135000,15539.305000,60.000000,0.037450
75%,39.250000,25285.055000,796.010000,76.357500,760.790000,24535.925000,60.000000,0.039000
max,60.000000,44409.600000,1289.530000,202.930000,1286.430000,43720.910000,60.000000,0.070200

In [6]:
m.dtypes

Month                 int64
Starting Balance    float64
Repayment           float64
Interest Paid       float64
Principal Paid      float64
New Balance         float64
term                  int64
interest_rate       float64
car_type             object
dtype: object

In [7]:
m['Month'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51,
       52, 53, 54, 55, 56, 57, 58, 59, 60], dtype=int64)

In [8]:
m['car_type'].unique()

array(['Toyota Sienna', 'Toyota Corolla', 'Toyota Carolla', 'VW Golf R'],
      dtype=object)

In [9]:
m.isnull().sum()

Month               0
Starting Balance    0
Repayment           0
Interest Paid       0
Principal Paid      0
New Balance         0
term                0
interest_rate       0
car_type            0
dtype: int64

In [10]:
m.tail()

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
403,56,3951.11,796.01,9.54,786.47,3164.64,60,0.029,VW Golf R
404,57,3164.64,796.01,7.64,788.37,2376.27,60,0.029,VW Golf R
405,58,2376.27,796.01,5.74,790.27,1586.00,60,0.029,VW Golf R
406,59,1586.00,796.01,3.83,792.18,793.82,60,0.029,VW Golf R
407,60,793.82,796.01,1.91,794.10,-0.28,60,0.029,VW Golf R

In [11]:
m['Principal Paid'].dtype

dtype('float64')

In [12]:
m['Principal Paid'].max()

1286.43

In [13]:
m['Principal Paid'].min()

326.62

In [14]:
m.head(3)

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna

In [15]:
m[m['car_type']=='Toyota Sienna']['Principal Paid'].max()

683.24

In [16]:
m[m['car_type']=='Toyota Sienna']['Principal Paid'].min()

484.3

In [17]:
m[m['car_type']=='Toyota Sienna']['Principal Paid'].sum()

69380.61

In [18]:
m[m['car_type']=='Toyota Sienna']['Interest Paid'].sum()

9801.39

In [19]:
m[m['car_type']=='Toyota Sienna']['interest_rate'].unique()

array([0.0702, 0.0359])

In [20]:
m[m['car_type']=='Toyota Sienna'].loc[50:60,:]

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
50,51,6656.00,687.23,38.93,648.30,6007.70,60,0.0702,Toyota Sienna
51,52,6007.70,687.23,35.14,652.09,5355.61,60,0.0702,Toyota Sienna
52,53,5355.61,687.23,31.33,655.90,4699.71,60,0.0702,Toyota Sienna
53,54,4699.71,687.23,27.49,659.74,4039.97,60,0.0702,Toyota Sienna
54,55,4039.97,687.23,23.63,663.60,3376.37,60,0.0702,Toyota Sienna
55,56,3376.37,687.23,19.75,667.48,2708.89,60,0.0702,Toyota Sienna
56,57,2708.89,687.23,15.84,671.39,2037.50,60,0.0702,Toyota Sienna
57,58,2037.50,687.23,11.91,675.32,1362.18,60,0.0702,Toyota Sienna
58,59,1362.18,687.23,7.96,679.27,682.91,60,0.0702,Toyota Sienna
59,60,682.91,687.23,3.99,683.24,-0.33,60,0.0702,Toyota Sienna
60,1,34689.96,632.47,103.78,528.69,34161.27,60,0.0359,Toyota Sienna

In [21]:
m[m['car_type']=='Toyota Sienna']['Principal Paid'].unique()

array([484.3 , 487.13, 489.98, 492.85, 495.73, 498.63, 501.55, 504.48,
       507.43, 510.4 , 513.39, 516.39, 519.41, 522.45, 525.51, 528.58,
       531.67, 534.78, 537.91, 541.06, 544.22, 547.41, 550.61, 553.83,
       557.07, 560.33, 563.61, 566.9 , 570.22, 573.56, 576.91, 580.29,
       583.68, 587.1 , 590.53, 593.99, 597.46, 600.96, 604.47, 608.01,
       611.56, 615.14, 618.74, 622.36, 626.  , 629.66, 633.35, 637.05,
       640.78, 644.53, 648.3 , 652.09, 655.9 , 659.74, 663.6 , 667.48,
       671.39, 675.32, 679.27, 683.24, 528.69, 530.28, 531.86, 533.45,
       535.05, 536.65, 538.26, 539.87, 541.48, 543.1 , 544.73, 546.36,
       547.99, 549.63, 551.27, 552.92, 554.58, 556.24, 557.9 , 559.57,
       561.24, 562.92, 564.61, 566.3 , 567.99, 569.69, 571.39, 573.1 ,
       574.82, 576.54, 578.26, 579.99, 581.73, 583.47, 585.21, 586.96,
       588.72, 590.48, 592.25, 594.02, 595.8 , 597.58, 599.37, 601.16,
       602.96, 604.76, 606.57, 608.39, 610.21, 612.03, 613.86, 615.7 ,
       617.54, 619.39, 621.24, 623.1 , 624.96, 626.83, 628.71, 630.59])

In [22]:
m[m['Principal Paid']==683.24]

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
59,60,682.91,687.23,3.99,683.24,-0.33,60,0.0702,Toyota Sienna

In [23]:
m[m['Principal Paid']==484.3]

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.3,34205.66,60,0.0702,Toyota Sienna

In [24]:
m[m['car_type']=='Toyota Carolla'].count()

Month               111
Starting Balance    111
Repayment           111
Interest Paid       111
Principal Paid      111
New Balance         111
term                111
interest_rate       111
car_type            111
dtype: int64

In [25]:
m[m['car_type']=='Toyota Sienna'].count()

Month               120
Starting Balance    120
Repayment           120
Interest Paid       120
Principal Paid      120
New Balance         120
term                120
interest_rate       120
car_type            120
dtype: int64

In [26]:
m[m['car_type']=='VW Golf R'].count()

Month               144
Starting Balance    144
Repayment           144
Interest Paid       144
Principal Paid      144
New Balance         144
term                144
interest_rate       144
car_type            144
dtype: int64

In [27]:
m[m['car_type']=='Toyota Corolla'].count()

Month               33
Starting Balance    33
Repayment           33
Interest Paid       33
Principal Paid      33
New Balance         33
term                33
interest_rate       33
car_type            33
dtype: int64

In [28]:
m[m['car_type']=='Toyota Carolla'].count()

Month               111
Starting Balance    111
Repayment           111
Interest Paid       111
Principal Paid      111
New Balance         111
term                111
interest_rate       111
car_type            111
dtype: int64

In [29]:
m['Starting Balance'].max()

44409.6

In [30]:
m[m['Starting Balance']==44409.6]

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
264,1,44409.6,1289.53,107.32,1182.21,43227.39,36,0.029,VW Golf R
300,1,44409.6,981.02,107.32,873.70,43535.90,48,0.029,VW Golf R
348,1,44409.6,796.01,107.32,688.69,43720.91,60,0.029,VW Golf R

In [31]:
m['interest_rate'].max()

0.0702

In [32]:
m[m['car_type']=='Toyota Carolla']['interest_rate'].unique()

array([0.039])

In [33]:
m[m['car_type']=='Toyota Carolla'].loc[:,'interest_rate'].max()

0.039

In [34]:
m[m['car_type']=='Toyota Carolla'].loc[:,'interest_rate'].min()

0.039

In [42]:
m[m['car_type']=='Toyota Carolla']
m.groupby('car_type').agg(['min','max','mean'])

               Month                Starting Balance                          \
                 min max       mean              min       max          mean
car_type
Toyota Carolla     1  60  27.657658           395.41  21600.00  11273.869730
Toyota Corolla     1  36  18.242424           634.43  21600.00  11460.686061
Toyota Sienna      1  60  30.500000           630.23  34689.96  18397.450167
VW Golf R          1  60  25.500000           793.82  44409.60  23113.575694

               Repayment                      Interest Paid  ...  \
                     min      max        mean           min  ...
car_type                                                     ...
Toyota Carolla    396.82   636.76  442.189189          1.28  ...
Toyota Corolla    636.76   636.76  636.760000          2.06  ...
Toyota Sienna     632.47   687.23  659.850000          1.88  ...
VW Golf R         796.01  1289.53  981.060000          1.91  ...

               Principal Paid New Balance                         term      \
                         mean         min       max          mean  min max
car_type
Toyota Carolla     405.553784       -0.15  21273.38  10868.315946   36  60
Toyota Corolla     599.517576       -0.27  21033.44  10861.168485   36  36
Toyota Sienna      578.171750       -0.36  34205.66  17819.278417   60  60
VW Golf R          925.206875       -0.49  43720.91  22188.368819   36  60

                          interest_rate
                     mean           min     max     mean
car_type
Toyota Carolla  54.162162        0.0390  0.0390  0.03900
Toyota Corolla  36.000000        0.0390  0.0390  0.03900
Toyota Sienna   60.000000        0.0359  0.0702  0.05305
VW Golf R       50.000000        0.0290  0.0290  0.02900

[4 rows x 24 columns]